In [0]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis-kelamin kelas
0         1       Kimia     47     laki-laki   12B
1         2     Ekonomi     39     perempuan   12D
2         3  Matematika     81     laki-laki   12D
3         4     Ekonomi     26     laki-laki   12D
4         5  Matematika     43     laki-laki   12C

<h2>Quiz 1 : Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [0]:
df.loc[:, 'nilai':'kelas']

In [0]:
df.loc[5:10, 'pelajaran':'nilai']

   pelajaran  nilai
5    ekonomi     91
6    ekonomi     50
7    ekonomi     29
8    ekonomi     56
9    ekonomi     45
10   ekonomi     27

<h2>Quiz 2 : Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [0]:
pelajaran1 = df['pelajaran'] == 'Ekonomi'
pelajaran2 = df['pelajaran'] == 'Fisika'
nilai1 = df['nilai'] > 50
pelajaran3 = df['pelajaran'] == 'Kimia'
nilai2 = df['nilai'] > 70
jenis1 = df['jenis-kelamin'] == 'perempuan'
kelas1 = df['kelas'] == '12C'

In [0]:
df[pelajaran1 | pelajaran2]

In [0]:
df[nilai1 & pelajaran3]

In [0]:
df[nilai2 & jenis1 & kelas1]

<h2>Quiz 3 : Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![image.png](attachment:image.png)

In [0]:
def normalisasi(x):
  return (x - x.min()) / (x.max() - x.min())

In [0]:
df[['nilai']].apply(normalisasi)

       nilai
0   0.580247
1   0.481481
2   1.000000
3   0.320988
4   0.530864
5   0.320988
6   0.617284
7   0.580247
8   0.283951
9   0.481481
10  0.580247
11  0.000000
12  0.592593
13  0.740741
14  0.148148
15  0.308642
16  0.728395
17  0.234568
18  0.234568
19  0.296296